# DataFrame

* a data table object
* numpy array-like
* each column can have a diffrent type
* size mutable(변할 수 있는): insert and delete columns

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
# Example from - https://chrisalbon.com/python/pandas_map_values_to_values.html
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [3]:
DataFrame(raw_data, columns = ["age", "city"])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [5]:
DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [6]:
df = DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [7]:
df["city"]

0    San Francisco
1        Baltimore
2            Miami
3          Douglas
4           Boston
Name: city, dtype: object

In [8]:
df.loc[2:4]

  first_name last_name  age     city debt
2       Tina       Ali   36    Miami  NaN
3       Jake    Milner   24  Douglas  NaN
4        Amy     Cooze   73   Boston  NaN

In [9]:
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [10]:
df["age"]

0    42
1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [11]:
df["age"].iloc[2:4]

2    36
3    24
Name: age, dtype: int64

In [12]:
# Example from - https://stackoverflow.com/questions/31593201/pandas-iloc-vs-ix-vs-loc-explanation# Examp 
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [17]:
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [18]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [15]:
df.age > 30

0     True
1     True
2     True
3    False
4     True
Name: age, dtype: bool

In [19]:
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [22]:
df["debt2"] = df.age > 30
df

  first_name last_name  age           city   debt  debt2
0      Jason    Miller   42  San Francisco   True   True
1      Molly  Jacobson   52      Baltimore   True   True
2       Tina       Ali   36          Miami  False   True
3       Jake    Milner   24        Douglas  False  False
4        Amy     Cooze   73         Boston   True   True

In [23]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True
debt2                True       True   True    False    True

In [24]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True, True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True, True],
       ['Tina', 'Ali', 36, 'Miami', False, True],
       ['Jake', 'Milner', 24, 'Douglas', False, False],
       ['Amy', 'Cooze', 73, 'Boston', True, True]], dtype=object)

In [25]:
df.to_csv()

',first_name,last_name,age,city,debt,debt2\n0,Jason,Miller,42,San Francisco,True,True\n1,Molly,Jacobson,52,Baltimore,True,True\n2,Tina,Ali,36,Miami,False,True\n3,Jake,Milner,24,Douglas,False,False\n4,Amy,Cooze,73,Boston,True,True\n'

In [27]:
del df['debt2']
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True